In [1]:
import pandas as pd

In [2]:
# From a dictionary of lists
data = {
    "Name": ["Arun", "Barun", "Samikshya"],
    "Age": [25, 30, 22],
    "Skills": [["Python", "Pandas"], ["Marketing"], ["Law", "Policy"]]
}
df = pd.DataFrame(data)
print(df)

        Name  Age            Skills
0       Arun   25  [Python, Pandas]
1      Barun   30       [Marketing]
2  Samikshya   22     [Law, Policy]

In [3]:
df["Name"] #series

0         Arun
1        Barun
2    Samikshya
Name: Name, dtype: object

In [5]:
df[["Name"]] #dataframe

        Name
0       Arun
1      Barun
2  Samikshya

In [8]:
df[["Name", "Age"]]

        Name  Age
0       Arun   25
1      Barun   30
2  Samikshya   22

In [11]:
df.iloc[0]         # First row

Name                  Arun
Age                     25
Skills    [Python, Pandas]
Name: 0, dtype: object

In [12]:
df.iloc[1:3]       # Slice of rows

        Name  Age         Skills
1      Barun   30    [Marketing]
2  Samikshya   22  [Law, Policy]

In [14]:
df.loc[0]          # Same as iloc if default index

Name                  Arun
Age                     25
Skills    [Python, Pandas]
Name: 0, dtype: object

In [15]:
df.loc[1:3]

        Name  Age         Skills
1      Barun   30    [Marketing]
2  Samikshya   22  [Law, Policy]

In [25]:
df2 = pd.DataFrame(data, index=["a", "b", "c"])
print(df2.loc["a"])  # Row with index 'a'

Name                  Arun
Age                     25
Skills    [Python, Pandas]
Name: a, dtype: object

In [26]:
print(df2)

        Name  Age            Skills
a       Arun   25  [Python, Pandas]
b      Barun   30       [Marketing]
c  Samikshya   22     [Law, Policy]

In [28]:
df2.loc[["a", "c"], ["Name", "Skills"]]  # Specific rows and columns by name

        Name            Skills
a       Arun  [Python, Pandas]
c  Samikshya     [Law, Policy]

In [20]:
### Practise

In [19]:
practise_data = {
    "Student": ["A", "B", "C"], 
    "Score": [85, 90, 78], 
    "Passed": [True, True, False]}

practise_df = pd.DataFrame(practise_data)
print(practise_df)

  Student  Score  Passed
0       A     85    True
1       B     90    True
2       C     78   False

In [22]:
practise_df[["Score"]]

   Score
0     85
1     90
2     78

In [23]:
practise_df.iloc[1] #just the second row

Student       B
Score        90
Passed     True
Name: 1, dtype: object

In [29]:
### Filter Data

In [32]:
# Setup
df3 = pd.DataFrame({
    "Name": ["Arun", "Barun", "Samikshya"],
    "Age": [25, 30, 22],
    "Passed": [True, False, True]
})
# Example: select rows where Age > 23
df3[df3["Age"] > 23]

    Name  Age  Passed
0   Arun   25    True
1  Barun   30   False

In [33]:
# Example: select rows where Passed is True
df3[df3["Passed"] == True]

        Name  Age  Passed
0       Arun   25    True
2  Samikshya   22    True

In [ ]:
### modifying data

In [35]:
df3.loc[0, "Age"] = 26
print(df3)

        Name  Age  Passed
0       Arun   26    True
1      Barun   30   False
2  Samikshya   22    True

In [36]:
df3["Passed"] = False  # Set all to False
print(df3)

        Name  Age  Passed
0       Arun   26   False
1      Barun   30   False
2  Samikshya   22   False

In [39]:
df3.loc[df3["Age"] < 25, "Passed"] = True
print(df3)

        Name  Age  Passed
0       Arun   26   False
1      Barun   30   False
2  Samikshya   22    True

In [ ]:
### adding columns

In [40]:
df3["Grade"] = ["A", "B", "A-"]  # Add new column
print(df3)

        Name  Age  Passed Grade
0       Arun   26   False     A
1      Barun   30   False     B
2  Samikshya   22    True    A-

In [41]:
df3["AgePlusTen"] = df3["Age"] + 10 #create a new column from an existing one
print(df3)

        Name  Age  Passed Grade  AgePlusTen
0       Arun   26   False     A          36
1      Barun   30   False     B          40
2  Samikshya   22    True    A-          32

In [ ]:
### adding rows

In [43]:
df3.loc[3] = ["Christy", 24, True, "B+", 34]
print(df3)

        Name  Age  Passed Grade  AgePlusTen
0       Arun   26   False     A          36
1      Barun   30   False     B          40
2  Samikshya   22    True    A-          32
3    Christy   24    True    B+          34

In [ ]:
### dropping values (rows/columns)

In [47]:
df3.drop(1)                   # Drops row with index 1

        Name  Age  Passed Grade  AgePlusTen
0       Arun   26   False     A          36
2  Samikshya   22    True    A-          32
3    Christy   24    True    B+          34

In [48]:
df3.drop("Grade", axis=1)     # Drops 'Grade' column

        Name  Age  Passed  AgePlusTen
0       Arun   26   False          36
1      Barun   30   False          40
2  Samikshya   22    True          32
3    Christy   24    True          34

In [49]:
##Practise

In [36]:
import pandas as pd
data = {
    "Student": ["Ayesha", "Bilal", "Chin", "Deepa"],
    "Age": [22, 24, 23, 21],
    "Score": [88, 75, 90, 85],
    "Passed": [True, False, True, True]
}

df4 = pd.DataFrame(data)
df4.dtypes

Student    object
Age         int64
Score       int64
Passed       bool
dtype: object

In [37]:
df4["Grade"] = ["A", "C", "A+", "B+"]
print(df4)

  Student  Age  Score  Passed Grade
0  Ayesha   22     88    True     A
1   Bilal   24     75   False     C
2    Chin   23     90    True    A+
3   Deepa   21     85    True    B+

In [28]:
df4.dtypes

Student    object
Age         int64
Score       int64
Passed       bool
Grade      object
dtype: object

In [38]:
df4.loc[df4["Score"] > 85,["Student", "Grade"]]

  Student Grade
0  Ayesha     A
2    Chin    A+

In [30]:
df4.dtypes

Student    object
Age         int64
Score       int64
Passed       bool
Grade      object
dtype: object

In [39]:
df4.loc[df4["Student"] == "Chin", ["Score"]] = 92
print(df4)

  Student  Age  Score  Passed Grade
0  Ayesha   22     88    True     A
1   Bilal   24     75   False     C
2    Chin   23     92    True    A+
3   Deepa   21     85    True    B+

In [32]:
df4.dtypes

Student    object
Age         int64
Score       int64
Passed       bool
Grade      object
dtype: object

In [40]:
#df4[Passed] = df4["Score"] >= 85
df4.dtypes

Student    object
Age         int64
Score       int64
Passed       bool
Grade      object
dtype: object

In [41]:
df4.loc[4] = ["Eshan", 25, 78, "False", "B"]
print(df4)

  Student  Age  Score Passed Grade
0  Ayesha   22     88   True     A
1   Bilal   24     75  False     C
2    Chin   23     92   True    A+
3   Deepa   21     85   True    B+
4   Eshan   25     78  False     B

In [42]:
df4.dtypes

Student    object
Age         int64
Score       int64
Passed     object
Grade      object
dtype: object

In [48]:
df4 = df4[df4["Student"] != "Bilal"]

In [49]:
df4["Score Boosted"] = df4["Score"] + 5

C:\Users\aroon\AppData\Local\Temp\ipykernel_18612\1518095488.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4["Score Boosted"] = df4["Score"] + 5

In [50]:
sorted_df = df4.sort_values(by = "Score Boosted", ascending = False)
print(sorted_df)

  Student  Age  Score Passed Grade  Score Boosted
2    Chin   23     92   True    A+             97
0  Ayesha   22     88   True     A             93
3   Deepa   21     85   True    B+             90
4   Eshan   25     78  False     B             83

In [24]:
import pandas as pd

# Step 1: Create the DataFrame
data = {
    "Student": ["Ayesha", "Bilal", "Chin", "Deepa"],
    "Age": [22, 24, 23, 21],
    "Score": [88, 75, 90, 85],
    "Passed": [True, False, True, True]
}
df = pd.DataFrame(data)

# Step 2: Add "Grade" column
df["Grade"] = ["A", "C", "A+", "B+"]

# Step 3: Filter students who scored above 85
filtered_df = df[df["Score"] > 85][["Student", "Grade"]]
print("Students scoring above 85:\n", filtered_df)

# Step 4: Modify Chin’s score and update Passed status
df.loc[df["Student"] == "Chin", "Score"] = 92
df["Passed"] = df["Score"] >= 80

# Step 5: Add new student Eshan
new_row = {
    "Student": "Eshan",
    "Age": 25,
    "Score": 78,
    "Passed": False,
    "Grade": "B"
}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

# Step 6: Remove Bilal
df = df[df["Student"] != "Bilal"]

# BONUS: Add "Score Boosted" column (+5 points)
df["Score Boosted"] = df["Score"] + 5

# Sort by "Score Boosted" descending
df_sorted = df.sort_values(by="Score Boosted", ascending=False)

# Final Output
print("\nFinal DataFrame after all steps including Bonus:")
print(df_sorted)

Students scoring above 85:
   Student Grade
0  Ayesha     A
2    Chin    A+

Final DataFrame after all steps including Bonus:
  Student  Age  Score  Passed Grade  Score Boosted
2    Chin   23     92    True    A+             97
0  Ayesha   22     88    True     A             93
3   Deepa   21     85    True    B+             90
4   Eshan   25     78   False     B             83